# # def monta_less():
# #     main= int(input("შეიყვანე რიცხი:"))
# #     main1 = int(input("შეიყვანე რიცხი:"))
# #     main2 = int(input("შეიყვანე რიცხი:"))
# #     main3 = int(input("შეიყვანე რიცხი:"))

# #     joon = main + main1 + main2 + main3
# #     a = joon / 4
# #     even = 0
# #     if main %2 == 0:
# #         even += 1
# #     if main1 %2 == 0:
# #         even += 1
# #     if main2 %2 == 0:
# #         even += 1
# #     if main3 %2 == 0:
# #         even += 1
# #     print(joon)
# #     print(a)
# #     print(even)
# # monta_less()

# for i in range(1 , 21):
#     print(i)

# for i in range(1 , 51):
#     if i % 2 == 0:
#         print(i)
# b = 0
# n = int(input("შეტვანე რიცხვი:"))
# for i in range(1 , n + 1):
#     b += 1 
# print(b)

# user = input(str("rame sheiyvane:"))
# for i in user:
#     print(user)

# def jooner_ked():


#     user = int(input("შეიყვანე პაროლი:"))
#     if user == "puthon123":
#         print("წვდომა მიღებულია")
#     else:
#         print("პაროლი არასწორია")

# jooner_ked()





























# ========================================

# ნაწილი I — თეორია (10 ქულა)

# 1) რას აკეთებს print() ფუნქცია

# --------------------------------------------------

# 2) რა განსხვავებაა for და while ციკლებს შორის

# --------------------------------------------------

# 3) რას აბრუნებს input()

# --------------------------------------------------

# 4) რა არის ცვლადი (variable)

# --------------------------------------------------

# 5) ჩამოთვალე 3 მონაცემთა ტიპი Python-ში.

# --------------------------------------------------

# ========================================

# ნაწილი II — კოდის წაკითხვა (10 ქულა)

# 6) რა დაიბეჭდება

# x = 5
# y = 3
# print(x + y)

# პასუხი
# --------------------------------------------------

# 7) რა დაიბეჭდება

# for i in range(3)
#     print(i)

# პასუხი
# --------------------------------------------------

# 8) რა დაიბეჭდება

# name = Giorgi
# print(name.upper())

# პასუხი
# --------------------------------------------------

# 9) რა იქნება პასუხი

# num = 10

# if num > 5
#     print(დიდია)
# else
#     print(პატარაა)

# პასუხი
# --------------------------------------------------

# 10) იპოვე შეცდომა

# print(Hello)

# პასუხი
# --------------------------------------------------

# ========================================

# ნაწილი III — პრაქტიკული დავალებები (30 ქულა)

# 11) დაწერე პროგრამა, რომელიც დაბეჭდავს

# Hello World

# --------------------------------------------------

# 12) მომხმარებელს შემოატანინე სახელი და დაბეჭდე

# Hello, სახელი

# --------------------------------------------------

# 13) მომხმარებელს შემოატანინე 2 რიცხვი და დაბეჭდე მათი ჯამი.

# --------------------------------------------------

# 14) დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 10-მდე for ციკლით.

# --------------------------------------------------

# 15) დაწერე პროგრამა, რომელიც შეამოწმებს რიცხვი ლუწია თუ კენტი.

# --------------------------------------------------
# ... (24 lines left)


#1)
# print() ფუნქცია გამოსახავს ტერმინალში ფრჩხილებ შორის ჩაწერილ სიტყვას რიცხვს  და ასშ


#2)
#for და while შორის განსხვავება
#for - გამოიყენება ასოების სიტყვები გასაემეორებლად
#ხოლო while ციკლი გამოიყენება როცა ზუსტად აარ იცი რამდენჯერ იუმუშაოს პირობამ 

#3)
#input() აბრუნდებს output ანუ რასაც მომხმარებელი შეიყვანს იმას
#მაგალითად input("შეიყვანე რიცხვი:") ეს კოდი გამოსახაავს ფრჩხილებს შორის შეტანილ სიტყვას ან ასოს ანუ ამ ჯერად შეიყვანე რიცხვი

#4)
#variable არის ცვლადი 
#მაგალითად a = (სიტყვაზე ვთქვათ) გამატჯობა
#variable ცვლადი რომელიც ინახავს მონაცემებს

#5)
#int - float - str

#6)
#რას გამოიტანს
# x = 5
# y = 3
# print(x + y)
#გამოიტანს 8 რადგან print-ში წერია + და არ არის ჩასმული "" ეს იმას ნიშნავს რო არა როგორც str არამდე int ჩაითვლება

# 7) რა დაიბეჭდება

# for i in range(3)
#     print(i)

# პასუხი 3
#        3
#        3


# 8) რა დაიბეჭდება

# name = Giorgi
# print(name.upper())

# პასუხი დიდი ასოებით GIORGI


# 9) რა იქნება პასუხი

# num = 10

# if num > 5:
#     print(დიდია)
# else:
#     print(პატარაა)

# პასუხი გამოიტანს დიდია თუ num 5ზე მეტია


# 10) იპოვე შეცდომა

# print(Hello)

# პასუხი შეცდპა ისა რომ არ აქვს "" სწორი ვარიანტი იქნება  print("Hello")


# ნაწილი III — პრაქტიკული დავალებები (30 ქულა)

# 11) დაწერე პროგრამა, რომელიც დაბეჭდავს

# Hello World

print("Hello World")


# 12) მომხმარებელს შემოატანინე სახელი და დაბეჭდე

# Hello, სახელი

a = input(str("შეიყვანე სახელი:"))

print("Hello", a)

# 13) მომხმარებელს შემოატანინე 2 რიცხვი და დაბეჭდე მათი ჯამი.

user = int(input("შემოიყვანე რიცხვი1 :"))
user1 = int(input("შემოიყვანე რიცხვი2 :"))

print(user + user1)

# 14) დაწერე პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 10-მდე for ციკლით.

for i in range(1,11):
    print(i)

# 15) დაწერე პროგრამა, რომელიც შეამოწმებს რიცხვი ლუწია თუ კენტი.

b = int(input("შეიყვანე რიცხვი:"))

if b %2 == 0:
    print("ლუწია")
else:
    print("კენტია")

