#დავალება 2

# name = input("სახელი: ")

# for i in range(16):
#     print(name)
#-------------------------------------------
#დავალება 3

# a = "1234"

# b = input("გამოიცანი პაროლი:")


# while b != a or b != a:

#     b = input("გამოიცანი პაროლი:")

# print("მრავო შენ გამოიცანი!")
    
#-------------------------------------------


#დავალება 4

# num = int(input('რიცხვი: '))

# while  num <= 150:
    
   
#        print(num)
#        num = num  * 2  

#-------------------------------------------

#დავალება 5

# a = int(input("რიცხვი შეიყვანე:"))

# b = int(input("რიცხვი შეიყვანე:"))

# c = int(input("რიცხვი შეიყვანე:"))

# d = int(input("რიცხვი შეიყვანე:"))

# print(int(a + b  + c + d))


#-------------------------------------------