#დიაპაზონები

#Sequences 
#თანმიმდევრობა 

#Iterations
#იტერნაცია

#Selections
#არჩევანი

#flowchart
#სხვადასხვა დიაპაზონების ერთიანობა

#pseudocode
#გამარტივებული ენა რომელიც გვეხმარება მარტივად გამოვსახოთ კოდი
#არა რის პროგრამირების ენა მაგრამ ცოტათი გავს




#ფორციკლი დაგვეხმარება რო დავწეროთ ერთი და იგივე კოდი ათასჯერ
print("hello world")
#for loop გვეხმარება დავწერპთ ჩქარა და მელე ერთი სიტყვა იმდენჯერ რამდენჯერაც გვინდა
for i in range(5):
    print('Hello World')
#ვაიციკლი

# for i in range(5):
#      print(i + 1)
# o + 1 = 1
# 1 + 1 = 2
# 2 + 1 = 3
# 3 + 1 = 4
# 4 + 1 = 5


#for - არის სინტაქსის შემადგენელი ნაწილი
# i - არის საიტერაციო ცვლადი , რომელიც არის ცვალებადი რაც იმას ნიშნავს , რომ შეგვიძლია შევუცვალოთ დასახელება
# in - არის აინტაქსის შემადგენელი ნაწილი
# range() - არის ფუნქცია რომელიც აკონტროლებს სიშირეს(output, program)
#   N1  N2 N3
#N1 არის საიდან უნდა დაიწყოს ათვლა
#N2 სადამდე უნდა გაგრძელდეს ათვლა
#N3 ყოველ იტერაციაზე რამდენიმე უნდა გაიზარდოს

#ინდეტაცია არის 2 კედელს შორის დაშორება



for i in range(2, 57):
    print(i)


    main = "Hello"

for i in main:
    print(i)

for i in range(10, 76):
    print(i * 3)


