
name = input("შენი სახელი ?:")
print("გამარჯობა " , name)

last_name = input("შენი გვარი ? :  ")

print("სასიამოვნოა შენი გაცნობა " , name , last_name)

print("რომელ ქვეყანაში  ცხოვორებ? ")

country = input()

city = input("და რომელ ქალაქში? : ")

print("გასაოცარია როცა დრო გექნება შენზე ბევრი რამ მომიყევი")

number = int(input("შეიიყვანე რიცხვი და მე ვეცდები ორზე გაგიმრავლო : "))

print(number * number)

a = int(input("გინდა დაგეხმარო მათემატიკაში? მითხარი რომე რიცხვი და მე გაგიმრავლებ! , 1= "))

print(a * a)

b = int(input("მოდი კიდევ 4 ჯელ დაგეხმარები გამრავლებაში და მერე ახალზე გადავიდეთ ! 2= "))

print(b * b)

c = int(input("3="))

print(c * c)

D = int(input("4="))

print(D * D)


E = int(input("5="))

print(E * E)

print("ახლა დროა გაყოფის ყველაფერს რასაც დაწერ გაიყოფა 2ზე")

R = int(input("ახლა გაყოფის დრო მოვიდა! , 1= "))

print(R / 2)

G = int(input("მოდი კიდევ გავიმეოროთ! 2= "))

print(G / 2)

K = int(input("3="))

print(K / 2)

Z = int(input("4="))

print(Z / 2)


X = int(input("5="))

print(X / 2)


print("ახლა მიმატების დროა რა რიცხვსაც დაწერ ის რიცხვი თავის თავს დაემატება")

W = int(input("1= "))

print(W + W)

w = int(input(" 2= "))

print(w + w)

C = int(input("3="))

print(C + C)

d = int(input("4="))

print(d + d)


e = int(input("5="))

print(e + e)


print("ახლა გამოკლების დროა, რა რიცხვსაც დაწერ იმ რიცხვს 10 გამოაკლდება! ")

We= int(input("1= "))

print(We - 10)

wa = int(input(" 2= "))

print(wa - 10)

Cc = int(input("3="))

print(Cc - 10)

dd = int(input("4="))

print(dd - 10)


ee = int(input("5="))

print(ee - 10)



print("დავითი: გამარჯობა, მათე სახლში ხარ?")
print("მათე: გამრჯობა დავით კი სახლში ვარ ")
print("დავითი: გარეთ გამოხვალ?")
print("მათე: კი ჩავიცმევ და ჩამოვალ ")
print("დავითი: კაი დაუჩქარე!")
print("მათე: კაი მაცა ვცდილობა მალე ჩამოვიდე 5 წუთი მომე !")
print("დავითი: კაი , კაი მიდი გელოდები!")


# input() არის ფუნქცია, რომელიც გვაძლევს საშუალებას მომხმარებელმა შეიყვანოს ინფორმაცია
# მაგალითად სახელი, რიცხვი ან ტექსტი

# int() არის ფუნქცია, რომელიც ტექსტს (str) გადააქცევს რიცხვად (int)
# მაგალითად "5" გახდება 5 და შეგვიძლია მათემატიკური ოპერაციები გავაკეთოთ

# str() არის ფუნქცია, რომელიც რიცხვს ან სხვა ტიპს გადააქცევს ტექსტად
# მაგალითად 5 გახდება "5" და შეგვიძლია მისი დაბეჭდვა ტექსტთან ერთად








